const getUserMessages = (username) => {
  return {
    0: {
      message: `Привет 👋

<b>Я бот-помощник.</b> 
Моя задача - дать тебе всю необходимую информацию для понимания того, как мы работаем

Я буду последовательно давать тебе информацию по разным аспектам работы.
Чтобы не перегружать тебя, будем двигаться шаг за шагом.

Я буду скидывать тебе материалы; после некоторых из них будет небольшое задание, которое тебе нужно будет выполнить и прислать ответ мне. 

Ты можешь ознакамливаться с информацией в комфортном для тебя темпе. В целом, весь путь можно пройти за час, но ты можешь не торопиться и растянуть удовольствие :)

<b>Я бот, поэтому сразу несколько правил:</b> 

- Я не могу пообщаться с тобой и ответить тебе на вопросы; если они будут возникать пиши сюда: @${username} (также, чтобы ты не потерял этот контакт, он будет после каждого шага внизу рядом с кнопкой перехода на следующий шаг) 

- Я не вижу отредактированных сообщений, поэтому перед отправкой проверяй текст; если я отклоняю ответ - присылай заново с правками. 

<b>Все, что тебе необходимо для получения информации - тихое место и твой компьютер/ноутбук. 
Настройся на работу и погнали</b> 🚀

Если все понятно, пришли в ответ на это сообщение «+» 
и мы начнем!`,
    },
    1: {
      message: `<b>Краткое содержание пунктов, которые мы пройдем:</b>

1. Условия работы с нами 
2. Личный кабинет 
3. Этапы работы 
4. Принцип распределения аккаунтов для продвижения 
5. О коммуникации внутри команды 
6. Инструкции по работе в личном кабинете 
7. Заключение`,
    },
    2: {
      message: `<b>Как мы работаем:</b>

Мы даем тебе доступ в личный кабинет и выдаем для работы несколько аккаунтов Onlyfans 
(на тестовом этапе это 1-3, далее все зависит от твоих возможностей, в среднем одна команда у нас ведет 5-15 аккаунтов) 

<b>Условия оплаты:</b>

- 20% от дохода анкеты с фанатов, пришедших с твоего трафика на анкету
- бюджеты на твоей стороне (если ты используешь платные способы продвижения)`,
    },
    3: {
      message: `<b>Рабочий кабинет на нашей платформе 
это ваша панель инструментов. Что на ней есть:</b>

<b>1. Информация необходимая для ведения аккаунта</b>

- Ссылка на архив контента модели 
- Ссылка на аккаунт OF 
- Контакт менеджера 

<b>2. Вся информация по рекламным компаниям</b>

- Ссылка для использования в продвижении 
- Трекинг ключевых показателей в реальном времени (кол-во переходов/подписок/сумма продаж) 
- Сквозная аналитика (конверсии диалог/продажу/повторную продажу/ графики по фанатам, доходу и так далее) 

<b>Для маркетеров, которые уже прошли тестовый период:</b>
- Контакт модели  
- Возможность логиниться на аккаунт OF 

<b>Подробную инструкцию по использованию платформы вышлем позже</b>

<b>⚙️Задание</b>

Зарегистрироваться на платформе по ссылке (https://ccenter.io/auth/register)
при регистрации ввести вот этот ключ: <code>6n2T3liKs3</code>
(используй любую почту, пароль придумай любой) 

<b>После того как зарегистрируешься и залогинишься, пришли скриншот личного кабинета сюда в бот! (картинкой, не файлом)</b>`,
    },
    4: {
      message: `<b>Рассмотрим поэтапно как мы начинаем и выстраиваем сотрудничество</b>

<b>1 Шаг</b>

- Ознакомиться с условиями работы (пройти до конца этот бот) 
- Добавиться в рабочий чат 
- Выбрать из представленного портфолио моделей 1-3 (не больше), с которыми бы хотел начать работу 

<b>2 Шаг</b>

- Изучить функционал платформы 

<b>3 Шаг</b>

- Ты получаешь анкеты на платформе 
- Вся коммуникация с моделью на этом этапе через менеджера* анкеты, его контакт будет на платформе
<b>*менеджер - руководитель команды чаттеров, которые работают на этой анкете</b>

<b>4 Шаг</b>

Тестовый период. 
Твоя задача на этом этапе - показать на практике какой результат ты можешь дать 

Тестовый период идет 2-4 недели (зависит от твоего опыта и способов привлечения трафика). Но иногда может продлится и дольше 
На этом этапе ты уже зарабатываешь свои 20%, но мы пока не даем тебе большое кол-во анкет 

Анкеты, которые выдаются на тестовый период - это хорошие анкеты, по которым: 
- уже идет работа и есть стабильный результат 
- работают опытные секстеры 
- модель дала согласие на рекламу тем способом, которым ты планируешь продвигать ее анкету (со всеми моделями мы это обговариваем на старте) 
- у тебя есть возможность выбрать моделей на тестовый период из нескольких предложенных 
Но нужно иметь ввиду, что это не ТОПовые анкеты. По ТОПовым уже работают свои команды маркетинга, ведь именно эти команды и сделали эти анкеты ТОПовыми. Хочешь ТОПовую анкету - сделай её ТОПовой :) 

<b>Шаг 5</b>

Оптимизация и масштабирование 

После тестового периода, в зависимости от твоих желаний и возможностей, мы передаем тебе больше анкет. А также ты можешь углубляться в работу команды и плотнее работать с моделью. Что ты получаешь после тестового периода: 
- Доступ к модели (можешь общаться с ней напрямую, не через менеджера) 
- Возможность взять новые аккаунты (за один раз не более 10)
- индивидуально - доступ на аккаунт (предоставляем эту возможность, если есть необходимость) 

<b>⚙️Задание:</b> подумай о своих целях: сколько анкет ты хотел бы вести, с какими доходом? Сколько хочешь зарабатывать? 
Это задание мы никак не проверяем. Это для тебя! 
<b>Как подумаешь - жми «далее» и продолжим 🚀</b>`,
    },
    5: {
      message: `<b>Правила передачи аккаунтов маркетологам:</b>

1. Маркетологу может быть выдано не более 10 аккаунтов в один момент. (если маркетолог готов взять, например, 50 анкет в работу, он может брать по 10 в 5 или более заходов) 

2. Адекватное время теста - 4 недели (с учетом что некоторые греют нулевые аккаунты на Reddit) 

3. Время теста может быть продлено, если есть минимальный результат (в каждом случае обговаривается индивидуально) 

4. Если по итогам 4 недель адекватного результата на анкете нет, мы останавливаем работу с маркетологом по этой анкете (адекватный результат будет зависеть от особенностей трафика, внешних данных модели и других факторов. В среднем это 20-50 фанатов в день на анкету). 

<b>В процессе тестового периода не запрещено менять анкеты, если видите что дело в анкете - запросите ее поменять, это нормальная практика.</b>
`,
    },
    6: {
      message: `<b>О коммуникации</b>

Каким образом у нас происходит взаимодействие внутри команды? Расскажу несколько наших принципов + техническую сторону выстраивания общения в команде 

<b>Принципы</b>

<b>1. Простота и легкость в общении</b>

Мы общаемся по-партнерски, без излишней субординации. В тоже время уважительно, а не панибратски. 

<b>2. Если что-то не знаешь/не понимаешь - спроси.</b>

Первое время могут быть вопросы: по платформе, по общению с командой и так далее - не стесняйся их задавать. Чем больше первое время будет вопросов - тем быстрее ты освоишься и выйдешь на хороший доход

3. Если хочешь роста - проявляй инициативу 

Мы работаем с десятком команд. У всех разные цели и амбиции. Мы не сможем узнать о том, что у тебя есть крутые идеи, или что ты хочешь взять еще десяток аккаунтов и твои ресурсы позволяют это сделать, если ты сам нам об этом не скажешь. 

Предлагай идеи, запрашивай ресурс, и мы пойдем навстречу, так как заинтересованы в твоем росте. Но есть одно правило - при этом важно чтобы у тебя уже был твердый результат. Чем лучше ты делаешь свою работу, тем с большим вниманием мы будем прислушиваться к твоим идеям и запросам 

<b>Теперь поговорим о ролях в команде и каналах коммуникации.</b>

(*) пункты со звездочкой обозначают что эта роль в команде может и отсутствовать. Каждая модель у нас - это отдельный проект, на каких-то проектах работают десятки людей. Где-то 2-3 человека. Поэтому некоторые роли у одних анкет будут, у других не будут. 

1️⃣ У тебя есть общий чат, в котором есть руководитель работы с маркетинг-партнерами и его помощница. В нем мы обсуждаем получение новых аккаунтов для продвижения, технические вопросы по платформе, а также сложные и проблемные ситуации, которые не удалось решить с менеджером или моделью 

* 2️⃣. Менеджер - это человек который управляет командой чаттеров на анкете. От их работы зависит доход, в том числе и твой. Они заинтересованы в эффективности твоей работы, так как тоже получают свой процент. Вы можете обсуждать с ним идеи, как улучшить вашу совместную работу - это приветствуется. Также первое время общение с моделью будет через менеджера: передавать референсы и задания, давать обратную связь по ее контенту. 

* 3️⃣. Агент или проджект-менеджер. Это человек, представляющий интересы модели. В некоторых случаях общение с моделью будет проходить именно через него (то есть все задачи будет передавать модели он) 

* 4️⃣Модель. Сама модель также может быть частью команды и у вас может быть контакт с ней. Мы предоставляем возможность общаться напрямую с моделью когда модель не против, в этом есть необходимость, и вы уже проработали с нами какое-то время, к вам есть доверие. Как правило, модели в таких ситуациях активно включаются в генерацию идей по контенту, а также имеют возможность быстро предоставлять нужный для работы контент (в некоторых способах рекламы это обязательно)`,
    },
    7: {
      message: `<b>Детальная инструкция по работе на платформе</b>

1. <a href="https://telegra.ph/Instrukciya-po-platforme-12-11">Подробная текстовая инструкция</a>
2. <a href="https://youtu.be/VcgSeMTJpd0">Видеоинструкция</a>`,
    },
    8: {
      message: `<b>Поздравляю! Ты прошел до конца! Мне больше нечего тебе рассказывать 😁</b>

<b>Желаю тебе успехов и чтобы все у тебя получилось! 🙏🚀</b>

Ниже я скину pdf файл, это что-то вроде контракта, в нем закреплены задачи и ответственность каждой из сторон.

Прочитай его внимательно, если есть вопросы - задай их @${username}

<b>Если все понятно и ты со всем ознакомлен - нажимай кнопку «Готов приступать» и погнали 🚀</b>

<a href="https://drive.google.com/file/d/1kXi0Vrav98n4YururadpKu8DCsz66Kh9/view?usp=sharing">Контракт OnlyTraffic</a>`,
    },
  };
};

module.exports = { getUserMessages };
